<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_tensor" type="Parameter" version="opset1">
			<data shape="?,?,?,3" element_type="u8" />
			<output>
				<port id="0" precision="U8" names="input_tensor">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_76136" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="map_1/while/loop_counter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_14213" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="4" name="BatchMultiClassNonMaxSuppression/map/while/loop_counter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="Constant_3205" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="6" name="map/while/loop_counter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="7" name="map/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="U8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="map/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="map/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="map/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="map/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="map/while/Less_1" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="BOOL" />
			</output>
		</layer>
		<layer id="13" name="map/Const" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="14" name="map/while/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="BOOL" />
			</output>
		</layer>
		<layer id="15" name="map/while/LogicalAnd" type="LogicalAnd" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL" />
				<port id="1" precision="BOOL" />
			</input>
			<output>
				<port id="2" precision="BOOL" />
			</output>
		</layer>
		<layer id="16" name="map/TensorArrayV2_1" type="Const" version="opset1">
			<data element_type="f32" shape="0, 0" offset="12" size="1" />
			<output>
				<port id="0" precision="FP32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="map/TensorArrayV2_2" type="Const" version="opset1">
			<data element_type="i32" shape="0, 0" offset="12" size="1" />
			<output>
				<port id="0" precision="I32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="map/while" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="6" />
				<input external_port_id="3" internal_layer_id="5" />
				<input external_port_id="4" internal_layer_id="4" />
				<input external_port_id="5" internal_layer_id="3" />
				<input external_port_id="6" internal_layer_id="2" />
				<input external_port_id="7" internal_layer_id="1" />
				<input external_port_id="8" internal_layer_id="0" />
				<output external_port_id="9" internal_layer_id="88" />
				<output external_port_id="10" internal_layer_id="39" />
				<output external_port_id="-1" internal_layer_id="14" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="91" to-layer="6" />
				<edge from-layer="90" to-layer="5" />
				<edge from-layer="89" to-layer="4" />
				<edge from-layer="88" to-layer="3" />
				<edge from-layer="39" to-layer="2" />
				<edge from-layer="16" to-layer="1" />
				<edge from-layer="15" to-layer="0" />
			</back_edges>
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
				<port id="5" precision="FP32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
				<port id="6" precision="I32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
				<port id="7" precision="I32" />
				<port id="8" precision="U8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="9" precision="FP32">
					<dim>-1</dim>
					<dim>3145728</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="6" name="map_while_map_while_loop_counter" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_map_while_loop_counter" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="5" name="map_while_map_strided_slice" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_map_strided_slice" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="4" name="map_while_placeholder" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_placeholder" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="3" name="map_while_placeholder_1" type="Parameter" version="opset1">
						<data shape="?,?" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_placeholder_1" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="map_while_placeholder_2" type="Parameter" version="opset1">
						<data shape="?,?" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_placeholder_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="map_while_map_strided_slice_1_0" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_map_strided_slice_1_0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="0" name="map_while_tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor_0" type="Parameter" version="opset1">
						<data shape="?,?,?,3" element_type="u8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor_0" />
						</rt_info>
						<output>
							<port id="0" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="map/while/add_1/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add_1/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="8" name="map/while/add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="9" name="map/while/Less_1" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="10" name="map/while/add/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="11" name="map/while/add" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="12" name="map/while/Less" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="13" name="map/while/LogicalAnd" type="LogicalAnd" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/LogicalAnd" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL" />
							<port id="1" precision="BOOL" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="17" name="Concat_2982" type="Const" version="opset1">
						<data element_type="i32" shape="2" offset="13" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_2982" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="Reshape_2983" type="Reshape" version="opset1">
						<data special_zero="false" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Reshape_2983" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="19" name="Reshape_2977" type="Const" version="opset1">
						<data element_type="i32" shape="3" offset="21" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Reshape_2977" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="ConvertLike_2986" type="ConvertLike" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="ConvertLike_2986" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="Constant_2996" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_2996" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="22" name="ShapeOf_2987" type="ShapeOf" version="opset3">
						<data output_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="ShapeOf_2987" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="23" name="Constant_2988" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Slice_2990" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="Constant_2989" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Slice_2990" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="Slice_2990" type="StridedSlice" version="opset1">
						<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Slice_2990" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="Squeeze_2975" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Squeeze_2975, Squeeze_3014, Squeeze_3036" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
						<output>
							<port id="1" precision="I32" />
						</output>
					</layer>
					<layer id="27" name="Constant_2992" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_2992" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="Add_2993" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Add_2993" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="Maximum_2994" type="Maximum" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Maximum_2994" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="30" name="Subtract_2995" type="Subtract" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Subtract_2995" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="31" name="ShapeOf_2980" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="33" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="ShapeOf_2980" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="32" name="Concat_2997" type="Concat" version="opset1">
						<data axis="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_2997" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="33" name="Broadcast_2998" type="Broadcast" version="opset3">
						<data mode="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Broadcast_2998" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="34" name="Concat_2999" type="Concat" version="opset1">
						<data axis="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_2999" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="35" name="Constant_3049" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Slice_3051" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="36" name="Unsqueeze_3061" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze_3000, Unsqueeze_3061" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="37" name="Unsqueeze_3001" type="Const" version="opset1">
						<data element_type="i32" shape="1, 3" offset="21" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze_3001" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="38" name="map/while/TensorArrayV2Write_1/TensorListSetItem" type="ScatterUpdate" version="opset3">
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/TensorArrayV2Write_1/TensorListSetItem" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
								<dim>3</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="40" name="Concat_3043" type="Const" version="opset1">
						<data element_type="i32" shape="2" offset="37" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_3043" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="41" name="Reshape_3044" type="Reshape" version="opset1">
						<data special_zero="false" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Reshape_3044" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="42" name="Constant_457740_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 1, 1, 1" offset="45" size="2" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/mul/x" />
						</rt_info>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="43" name="Constant_457740" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/mul/x" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="44" name="Constant_3015" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3015" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="45" name="Gather_3016" type="Gather" version="opset8">
						<data batch_dims="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Gather_3016, map/while/TensorArrayV2Read/TensorListGetItem" />
						</rt_info>
						<input>
							<port id="0" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32" />
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="46" name="map/while/Cast" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Cast" />
						</rt_info>
						<input>
							<port id="0" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="47" name="map/while/strided_slice/stack" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="47" size="16" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice/stack" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="48" name="map/while/strided_slice/stack_1" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="47" size="16" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice/stack_1" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="49" name="map/while/strided_slice/stack_2" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="63" size="16" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice/stack_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="50" name="map/while/strided_slice" type="StridedSlice" version="opset1">
						<data begin_mask="0, 1, 1, 1" end_mask="0, 1, 1, 1" new_axis_mask="1, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Split_3021, map/while/strided_slice" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>4</dim>
							</port>
							<port id="2" precision="I32">
								<dim>4</dim>
							</port>
							<port id="3" precision="I32">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="51" name="Constant_3020" type="Const" version="opset1">
						<data element_type="i64" shape="" offset="79" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3020" />
						</rt_info>
						<output>
							<port id="0" precision="I64" />
						</output>
					</layer>
					<layer id="52" name="Squeeze_3022" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Squeeze_3022" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="53" name="map/while/Preprocessor/ResizeImage/resize/ExpandDims/dim" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeImage/resize/ExpandDims/dim" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="54" name="map/while/Preprocessor/ResizeImage/resize/ExpandDims" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Convert_3025, map/while/Preprocessor/ResizeImage/resize/ExpandDims" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="55" name="map/while/Preprocessor/ResizeImage/stack" type="Const" version="opset1">
						<data element_type="i32" shape="2" offset="87" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeImage/stack" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="56" name="Constant_3024" type="Const" version="opset1">
						<data element_type="i32" shape="2" offset="95" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3024" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="57" name="map/while/Preprocessor/ResizeImage/resize/ResizeBilinear" type="Interpolate" version="opset11">
						<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="asymmetric" nearest_mode="round_prefer_floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeImage/resize/ResizeBilinear" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
							<port id="2" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="58" name="Constant_3027" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3027" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="59" name="map/while/Preprocessor/ResizeImage/resize/Squeeze" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeImage/resize/Squeeze" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="60" name="Constant_3029" type="Const" version="opset1">
						<data element_type="i64" shape="" offset="79" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3029" />
						</rt_info>
						<output>
							<port id="0" precision="I64" />
						</output>
					</layer>
					<layer id="61" name="Unsqueeze_3030" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze_3030, map/while/Preprocessor/stack" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="62" name="map/while/Preprocessor/mul" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/mul" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="63" name="Constant_457741_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 1, 1, 1" offset="103" size="2" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/sub, map/while/Preprocessor/sub/y" />
						</rt_info>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="64" name="Constant_457741" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/sub, map/while/Preprocessor/sub/y" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="65" name="map/while/Preprocessor/sub" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/sub, map/while/Preprocessor/sub/y" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="66" name="map/while/strided_slice_1/stack" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="4" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice_1/stack" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="67" name="map/while/strided_slice_1/stack_1" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice_1/stack_1" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="68" name="map/while/strided_slice_1/stack_2" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice_1/stack_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="69" name="map/while/strided_slice_1" type="StridedSlice" version="opset1">
						<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice_1" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="FP32">
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="70" name="Constant_357666" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="105" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_357666" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="71" name="Reshape_3038" type="Reshape" version="opset1">
						<data special_zero="false" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Reshape_3038" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1024</dim>
								<dim>1024</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="72" name="ConvertLike_3047" type="ConvertLike" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="ConvertLike_3047" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>3145728</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="73" name="Constant_3057_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="" offset="113" size="2" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3057" />
						</rt_info>
						<output>
							<port id="0" precision="FP16" />
						</output>
					</layer>
					<layer id="74" name="Constant_3057" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
							<attribute name="fused_names" version="0" value="Constant_3057" />
						</rt_info>
						<input>
							<port id="0" precision="FP16" />
						</input>
						<output>
							<port id="1" precision="FP32" />
						</output>
					</layer>
					<layer id="75" name="ShapeOf_3048" type="ShapeOf" version="opset3">
						<data output_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="ShapeOf_3048" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="76" name="Constant_3050" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Slice_3051" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="77" name="Slice_3051" type="StridedSlice" version="opset1">
						<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Slice_3051" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="78" name="Constant_3053" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="8" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_3053" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="79" name="Add_3054" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Add_3054" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="80" name="Maximum_3055" type="Maximum" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Maximum_3055" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="81" name="Subtract_3056" type="Subtract" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Subtract_3056" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="82" name="ShapeOf_3041" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="115" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="ShapeOf_3041" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="83" name="Concat_3058" type="Concat" version="opset1">
						<data axis="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_3058" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="84" name="Broadcast_3059" type="Broadcast" version="opset3">
						<data mode="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Broadcast_3059" />
						</rt_info>
						<input>
							<port id="0" precision="FP32" />
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="85" name="Concat_3060" type="Concat" version="opset1">
						<data axis="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_3060" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="86" name="Unsqueeze_3062" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze_3062" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>3145728</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="87" name="map/while/TensorArrayV2Write/TensorListSetItem" type="ScatterUpdate" version="opset3">
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/TensorArrayV2Write/TensorListSetItem" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>3145728</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</output>
					</layer>
					<layer id="91" name="map_while_identity" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_identity" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="90" name="map_while_identity_1" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_identity_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="89" name="map_while_identity_2" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_identity_2" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="88" name="map_while_identity_3" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_identity_3" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>3145728</dim>
							</port>
						</input>
					</layer>
					<layer id="39" name="map_while_identity_4" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_identity_4" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
					</layer>
					<layer id="16" name="map_while_map_strided_slice_1" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_map_strided_slice_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="15" name="map_while_tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor" />
						</rt_info>
						<input>
							<port id="0" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
					</layer>
					<layer id="14" name="map_while_identity0" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_identity" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL" />
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="45" to-port="0" />
					<edge from-layer="0" from-port="0" to-layer="15" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="12" to-port="1" />
					<edge from-layer="1" from-port="0" to-layer="16" to-port="0" />
